pet_examples/model_comp_corr/gpt3/mermaid/rulact_bpmn/1_3.mmd
graph LR
A:startevent:((startevent)) --> B:task:(Take order)
B:task:(Take order) --> C:task:(Submit ticket)
C:task:(Submit ticket) --> D:task:(Order sommelier)
D:task:(Order sommelier) --> E:task:(Prepare cart)
E:task:(Prepare cart) --> F:task:(Fetch wine)
F:task:(Fetch wine) --> G:task:(Prepare drinks)
G:task:(Prepare drinks) --> H:task:(Deliver order)
H:task:(Deliver order) --> I:task:(Debit account)
I:task:(Debit account) --> J:endevent:((endevent))
